// // ^ 1. Создайте переменную name и присвойте ей ваше имя. Выведите на экран фразу 'Привет, %Имя%!'.

// let name = "Михаил"
// console.log("Привет, " + name)

// // ^ 2. Создайте переменную num и присвойте ей значение '12345'. Найдите произведение (умножение) цифр этого числа.
// let num = [1,2,3,4,5]
// let mult = 1;

// for (let i = 0; i < num.length; i++) {
//     mult *= num[i]
// }
// console.log("Произведение чисел равно: " + mult)

// // ^ 3. Спросите у пользователя число. Выведите квадрат этого числа.

// let number = prompt("Введите число:");
// let result = Math.pow(number, 2)
// console.log(`Квадрат числа ${number} равен `+ result)

